fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет команду создания документа "Реализация товаров и услуг" на основании 
// в список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - ТаблицаЗначений - см. описание 1 параметра процедуры 
//      СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании().
//
// Возвращаемое значение:
// 	КомандаСозданияНаОсновании - СтрокаТаблицыЗначений, Неопределено - добавленная команда 
//      или Неопределено, если у пользователя недостаточно прав.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт

    Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда

        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер      = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи   = "Проводить";

        Возврат КомандаСоздатьНаОсновании;

    КонецЕсли;

    Возврат Неопределено;

КонецФункции


// Определяет настройки печати для объекта.
//
// Параметры:
//  НастройкиОбъекта - Структура - см. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати().
//      Настройки печати объекта (документа, справочника и т.п.).
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	
	// ++ Арканов Д.Ю. доработка дипломной работы
    НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры


// Добавляет команды печати в список команд печати объекта.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - состав полей см. в описании 
//      УправлениеПечатью.СоздатьКоллекциюКомандПечати().
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// ++ Арканов Д.Ю. доработка дипломной работы
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор  = "ПФ_DOC_АктВыполненныхРабот";
    КомандаПечати.Представление  = НСтр("ru = 'Акт выполненных работ (docx)'");
    КомандаПечати.Порядок        = 5;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры


// Формирует печатные формы объекта.
//
// Параметры:
//  МассивОбъектов           - Массив           - ссылки на объекты, для которых требуется сформировать печатные формы;
//  ПараметрыПечати          - Структура        - дополнительные настройки печати;
//  КоллекцияПечатныхФорм    - ТаблицаЗначений  - сформированные печатные формы (выходной параметр);
//  ОбъектыПечати            - СписокЗначений   - соответствие между объектами и именами областей 
//                                                 в табличном документе (выходной параметр);
//  ПараметрыВывода          - Структура        - дополнительные параметры вывода печатных форм.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// ++ Арканов Д.Ю. доработка дипломной работы
    ИмяМакета = "ПФ_DOC_АктВыполненныхРабот";

    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, ИмяМакета);
    Если ПечатнаяФорма <> Неопределено Тогда

        ПечатнаяФорма.ОфисныеДокументы = НапечататьАктВыполненныхработ(МассивОбъектов);
        ПечатнаяФорма.СинонимМакета    = НСтр("ru = 'Акт выполненных работ (docx)'");

    КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НапечататьАктВыполненныхработ(МассивОбъектов)
	
	// ++ Арканов Д.Ю. доработка дипломной работы
    ОфисныеДокументы = Новый Соответствие;

    Если МассивОбъектов.Количество() = 0 Тогда
        Возврат ОфисныеДокументы;
    КонецЕсли;

    // ───────────────────────────────────────────────────────────────
    // Один большой запрос на все документы сразу
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    Реализация.Ссылка            КАК Ссылка,
    |    Реализация.Номер             КАК Номер,
    |    Реализация.Дата              КАК Дата,
    |    Реализация.Организация       КАК Организация,
    |    Реализация.Контрагент        КАК Контрагент,
    |    Реализация.Договор           КАК Договор,
    |    Реализация.СуммаДокумента    КАК СуммаДокумента
    |ИЗ
    |    Документ.РеализацияТоваровУслуг КАК Реализация
    |ГДЕ
    |    Реализация.Ссылка В (&МассивСсылок)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    Услуги.Ссылка               КАК Ссылка,
    |    Услуги.НомерСтроки          КАК НомерСтроки,
    |    Услуги.Номенклатура         КАК Номенклатура,
    |    Услуги.Количество           КАК Количество,
    |    Услуги.Цена                 КАК Цена,
    |    Услуги.Сумма                КАК Сумма
    |ИЗ
    |    Документ.РеализацияТоваровУслуг.Услуги КАК Услуги
    |ГДЕ
    |    Услуги.Ссылка В (&МассивСсылок)
    |
    |УПОРЯДОЧИТЬ ПО
    |    Услуги.Ссылка,
    |    Услуги.НомерСтроки";

    Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);

    Пакет = Запрос.ВыполнитьПакет();
    Шапки   = Пакет[0].Выгрузить();
    УслугиВсе = Пакет[1].Выгрузить();

    Шапки.Индексы.Добавить("Ссылка");
    УслугиВсе.Индексы.Добавить("Ссылка");

    ШаблонИмени = "[Организация]-[Контрагент] Акт выполненных работ №[Номер] от [Дата]";

    Для Каждого Ссылка Из МассивОбъектов Цикл

        НайденныеСтроки = Шапки.НайтиСтроки(Новый Структура("Ссылка", Ссылка));
        Если НайденныеСтроки.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;

        ДанныеШапки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НайденныеСтроки[0]);

        ДанныеШапки.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.Номер);
        ДанныеШапки.Дата  = Формат(ДанныеШапки.Дата, "ДФ=dd.MM.yyyy");

        ДанныеШапки.Вставить("СуммаПрописью", ЧислоПрописью(
            ДанныеШапки.СуммаДокумента,
            "ru",
            "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"));

        // Услуги только по текущему документу
        СтрокиУслуг = УслугиВсе.НайтиСтроки(Новый Структура("Ссылка", Ссылка));
        ДанныеУслуги = ОбщегоНазначения.ТаблицаЗначенийВМассив(
            УслугиВсе.Скопировать(СтрокиУслуг));   // или напрямую СтрокиУслуг, если не нужен массив структур

        // ──────────────── Формируем документ ───────────────────────
        Адрес = СформироватьАктПоДанным(Ссылка, ДанныеШапки, ДанныеУслуги);

        Если Адрес <> Неопределено Тогда
            ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонИмени, ДанныеШапки);
            ОфисныеДокументы.Вставить(Адрес, ИмяДокумента);
        КонецЕсли;

    КонецЦикла;

    Возврат ОфисныеДокументы;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецФункции

Функция СформироватьАктПоДанным(Ссылка, ДанныеШапки, ДанныеУслуги)
	
	// ++ Арканов Д.Ю. доработка дипломной работы
    МакетДокумента = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АктВыполненныхРабот");
    Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);

    ОписаниеОбластей = Новый Структура;
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок",    "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка",        "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ТабличнаяЧасть","СтрокаТаблицы");
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Итого",        "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал",       "Общая");

    ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);

    // ──────────────────────────────────────────────
    // Заголовок
    Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Заголовок"]);
    УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеШапки);

    // Шапка
    Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);
    УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеШапки);

    // Табличная часть
    Если ДанныеУслуги.Количество() > 0 Тогда
        Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["ТабличнаяЧасть"]);
        УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, Область, ДанныеУслуги);
    КонецЕсли;

    // Итого + Подвал
    Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Итого"]);
    УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеШапки);

    Область = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);
    УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеШапки);

    // ──────────────────────────────────────────────
    Адрес = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);

    УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
    УправлениеПечатью.ОчиститьСсылки(Макет);

    Возврат Адрес;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецФункции

#КонецОбласти

#КонецЕсли
